{
    "architectures": [
        "BailingMoeForCausalLM"
    ],
    "attention_dropout": 0.0,
    "auto_map": {
        "AutoConfig": "configuration_bailing_moe.BailingMoeConfig",
        "AutoModel": "modeling_bailing_moe.BailingMoeModel",
        "AutoModelForCausalLM": "modeling_bailing_moe.BailingMoeForCausalLM"
    },
    "eos_token_id": 126081,
    "pad_token_id": 126081,
    "first_k_dense_replace": 0,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.006,
    "intermediate_size": 5632,
    "max_position_embeddings": 16384,
    "model_type": "bailing_moe",
    "moe_intermediate_size": 1408,
    "num_experts": 64,
    "num_shared_experts": 2,
    "norm_topk_prob": true,
    "num_attention_heads": 16,
    "num_experts_per_tok": 6,
    "num_hidden_layers": 28,
    "num_key_value_heads": 4,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 600000,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.36.0",
    "use_cache": true,
    "use_bias": false,
    "use_qkv_bias": false,
    "vocab_size": 126464,
    "output_router_logits": false,
    "embedding_dropout": 0.1,
    "norm_head": true,
    "norm_softmax": false,
    "output_dropout": 0.1
}
